/**
 * Логирует переданные аргументы в стандартный поток вывода
 * @returns {undefined}
 */
function log () {
  return console.log(new Date(), ...arguments)
}

module.exports = async function logger (ctx, next) {
  const start = Date.now()
  /*
    Это хорошее место, чтобы добавить в логи сведения о входящем запросе.
    Используйте функцию `log`, чтобы вывести логи в стандартный поток вывода.
    Например, log({ method: ctx.method }) запишет в логи HTTP-метод входящего запроса.
  */
  log({
    /*
      TODO:
        Добавьте в логи запись, содержащую следующие сведения:
        * HTTP-метод входящего запроса
        * URL-адрес входящего запроса
    */
  })

  await next()
  const duration = Date.now() - start
  /*
    TODO:
      Добавьте в логи запись, содержащую следующие сведения:
      * HTTP-метод входящего запроса
      * URL-адрес входящего запроса
      * длительность обработки запроса (duration)

    Подсказкка:
      Используйте блок try {...} finally {...} вокруг вызова следующего middleware,
      чтобы вывести логи даже в случае ошибки
  */
}
